/*
 * 	연산자 
 * 		ㄴ 증감연산자 (++, --) : 전치/후치 => 한개 증가 / 한개 감소
 * 			ㄴ for/ while
 * 		ㄴ 부정 연산자 (!) : boolean => if
 * 		ㄴ 형변환 연산자 : (데이터형)
 * 			ㄴ 클래스 형 변환
 * 
 * 		ㄴ 자바의 모든 클래스는 Object 상속을 받는다
 * 		ㄴ 라이브러리는 리턴시 Object
 * 		-------------------------------
 * 
 * 	산술 연산자 ( + , -, *, /, %)
 * 				+ : 산술, 문자열 결합
 * 				/ : 정수 / 정수 = 정수, 0으로 나눌 수 없다.
 * 				% : 부호가 왼쪽과 동일
 * 
 * 	비교 연산자 ( ==, !=, <, >, <=, >= )
 * 			boolean
 * 			오라클 = <>
 * 			js === !==
 * 	
 * 	논리 연산자 ( && ||)
 * 
 * 	대입 연산자 (=, +=, -=)
 * 		ㄴ 반복문 => 횟수
 * ------------------------------------------------------------
 * 
 * 제어문
 * 	if : 조건문
 * 	if ~ else : 선택문
 * 	ㄴ 오류처리 => 건너뛰기
 * 
 * 	for / while
 * 
 * 	break;
 * 
 * -------------------------------------------------------------
 * 
 * 데이터 관리
 * 	ㄴ 여러개 데이터를 묶어서 관리
 * 	ㄴ 같은 데이터 : 배열	
 * 	ㄴ 다른 데이터 : 관련이 있어야 함 : 클래스
 * 
 * 	ㄴ class => 사용자 정의 데이터형
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */

//import java.util.*;
//class A{
//	int a;
//	void aaa() {}
//}

public class 정리_2 {
	
	void aaa() {
		
	}
	
	public static void main(String[] args) throws Exception{
//		정리_2 a = new 정리_2();
//		정리_2 b = (정리_2)a.clone();

//
//		List<A> list = new ArrayList<A>();
//		list.add(new A());
//		list.add(new A());
//		list.add(new A());
//		
//		A aa = list.get(0);
//	
	}

}