
/*
 * 	JDK(Java Development Kit) <- 없으면 자바 실행 불가(자바 개발 키트)	
 * 		---	
 * 		JRE(Java Runtime Environment) -  JVM 뿐만 아니라 Java binaries, Java 클래스 라이브러리 등을 포함하고 있어 자바 프로그램의 실행을 지원
 * 		---
 * 		JVM(Java Virtual Machine) -  자바 프로글맹르 실행하기 위한 환경 제공
 * 		---
 * 		Library = API (java.util, java sql 등)
 * 		-------
 * 
 * 
 * -----------------------------------------------------------------
 * 		1. Devlopment Tool
 * 			javac : 컴퓨터가 인식하는 언어로 변경
 * 				=> (컴파일)
 * 			java : 프로글매 실행 (인터 프리터)
 * 				=> 한줄씩 읽어서 출력
 * 			javap : 역 컴파일러 => 자바로 원상복귀
 * 			javah : header 파일 읽기 => C/C++ 연동
 * 			javaw : 서버 구동
 * 			jar : 인증 / 배포
 * 				 웹 => war : maven
 * 				 자바 => jar : gradle : zip => tar
 * 						------------
 * 						  라이브러리
 * 	
 * 		2. JRE : 라이브러리르 포함하고 있다
 * 
 * 		------------------------------------------
 * 		JVM : 면접 
 * 			  ---
 * 			   = 기술면접
 * 			   = 코딩 테스트
 * 			   
 * 
 * 		=> 규칙 (약속)
 * 			1. 클래스명 : 대문자 시작
 * 						MainCLass
 * 						-  - 두번째 단어 시작 대문자 시작
 * 						=> 헝거리안식 표현법
 * 						_Main : 임시 파일 
 * 
 * 			2. 메소드명(소문자 => 기능처리
 * 
 * 			3. 변수명(소문자 => 필요한 데이터를 메모리에 저장)
 * 
 * 			4. 인터페이스(대문자 => 다른 클래스 연결(리모컨))
 * 			---------------가독성(수정이 편리)
 * 						   최적화(속도)
 * 						   메모리 관리
 * 				
 * 			
 */


public class 자바정리 {

	public static void main(String[] args) {
		
	}

}
