/*
 * 
 * 
 *  한개만 존재 => 배열 / 클래스(String은 클래스 이다)
 * 리턴형 메소드명(매개변수...) => 선언부
 * {			--------------데이터 묶음(매개변수 3개 이상)
 * 									ㄴ 배열 / 클래스
 * 		구현부
 * }
 * 
 * 메소를 가지고 있으면 클래스
 * => 일반 데이터형 / 클래스 형(String) 
 * 
 * 			메소드 명
 * 		----------------
 * 요청값
 *  ==>  매개변수 
 *  		ㄴ 처리 ====> 결과 값 / 자체 처리(void)
 * 		----------------
 * 
 * ----------------------------------------------
 * int disp(int a, int b)
 * {
 * 		
 * 
 * } // 메모리에 저장
 * 
 * 	int a = 10;
 * 	int b = 20;
 *  int c = 30;
 * 
 * Lifo / FiFo -> 윈도우 운영체제 스케줄러, 메시지
 * 
 * 메소드 
 * 	---- Call stack
 * void main(){
 * 		aaa();
 * }
 * 	void aaa(){
 * 		bbb();
 * }
 * void bbb(){
 * 		ccc();
 * }
 * void ccc(){
 * 		ddd();
 * }
 * void ddd(){
 * 		
 * }
 * 
 * 
 * 
 */



public class 메소드_4 {

	
	
	public static void main(String[] args) {  // {} 만 있으면 메모리에 할당된 것임
		
	}
}
