/*
 * 메소드 : 동작 / 행위를 구현
 * 		  ----------------기능 처리
 * 			1. 소스 간결 : 반복 제거
 * 				ㄴ 관련된 내용만 모아서 저장
 * 				ㄴ 디버깅 / 추가 / 수정
 * 			2. 가독성 = 단락
 * 			3. 형식 , 동작 순서, 호출 방식
 * 				---------------------
 * 				ㄴ 형식 
 * 					ㄴ 메소드명 => 의미부여
 * 								ㄴ 7 ~ 15자리에서 만들어진다
 * 					ㄴ 리턴형 => 사용자 요청한 데이터에 대해 처리 결 과 값 
 * 						ㄴ 바드시 1개만 설정이 가능
 * 						ㄴ테이터가 많은 경우(배열 / 클래스))
 * 					ㄴ 매개변수 => 사용자의 요청값
 * 					ㄴ 호출 
 * 						ㄴ 메서드 명(매개변수 값)
 * 							ㄴ 메소드 종료와 동시에 소멸
 * 
 */
public class 메소드_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
